#pragma once

#include <stdio.h>
#include <stdlib.h>
#include <assert.h>

#include <string>

#include "MfcJson.h"
#include "fcs.h"
#include "Log.h"
#include "fcslib_string.h"

class FcMsg : public FCMSG_Q
{
public:

    static const char* MapFcType(uint32_t dwType)
    {
        static char s_szType[64];

        switch (dwType)
        {
            case FCTYPE_NULL:               return "FCTYPE_NULL";               //  0
            case FCTYPE_LOGIN:              return "FCTYPE_LOGIN";              //  1
            case FCTYPE_ADDFRIEND:          return "FCTYPE_ADDFRIEND";          //  2
            case FCTYPE_PMESG:              return "FCTYPE_PMESG";              //  3
            case FCTYPE_STATUS:             return "FCTYPE_STATUS";             //  4
            case FCTYPE_DETAILS:            return "FCTYPE_DETAILS";            //  5
            case FCTYPE_TOKENINC:           return "FCTYPE_TOKENINC";           //  6
            case FCTYPE_ADDIGNORE:          return "FCTYPE_ADDIGNORE";          //  7
            case FCTYPE_PRIVACY:            return "FCTYPE_PRIVACY";            //  8
            case FCTYPE_ADDFRIENDREQ:       return "FCTYPE_ADDFRIENDREQ";       //  9
            case FCTYPE_USERNAMELOOKUP:     return "FCTYPE_USERNAMELOOKUP";     // 10
            case FCTYPE_ZBAN:               return "FCTYPE_ZBAN";               // 11
            case FCTYPE_BROADCASTNEWS:      return "FCTYPE_BROADCASTNEWS";      // 12
            case FCTYPE_ANNOUNCE:           return "FCTYPE_ANNOUNCE";           // 13
            case FCTYPE_MANAGELIST:         return "FCTYPE_MANAGELIST";         // 14
            case FCTYPE_INBOX:              return "FCTYPE_INBOX";              // 15
            case FCTYPE_GWCONNECT:          return "FCTYPE_GWCONNECT";          // 16
            case FCTYPE_RELOADSETTINGS:     return "FCTYPE_RELOADSETTINGS";     // 17
            case FCTYPE_HIDEUSERS:          return "FCTYPE_HIDEUSERS";          // 18
            case FCTYPE_RULEVIOLATION:      return "FCTYPE_RULEVIOLATION";      // 19
            case FCTYPE_SESSIONSTATE:       return "FCTYPE_SESSIONSTATE";       // 20
            case FCTYPE_REQUESTPVT:         return "FCTYPE_REQUESTPVT";         // 21
            case FCTYPE_ACCEPTPVT:          return "FCTYPE_ACCEPTPVT";          // 22
            case FCTYPE_REJECTPVT:          return "FCTYPE_REJECTPVT";          // 23
            case FCTYPE_ENDSESSION:         return "FCTYPE_ENDSESSION";         // 24
            case FCTYPE_TXPROFILE:          return "FCTYPE_TXPROFILE";          // 25
            case FCTYPE_STARTVOYEUR:        return "FCTYPE_STARTVOYEUR";        // 26
            case FCTYPE_SERVERREFRESH:      return "FCTYPE_SERVERREFRESH";      // 27
            case FCTYPE_SETTING:            return "FCTYPE_SETTING";            // 28
            case FCTYPE_BWSTATS:            return "FCTYPE_BWSTATS";            // 29
            case FCTYPE_TKX:                return "FCTYPE_TKX";                // 30
            case FCTYPE_SETTEXTOPT:         return "FCTYPE_SETTEXTOPT";         // 31
            case FCTYPE_SERVERCONFIG:       return "FCTYPE_SERVERCONFIG";       // 32
            case FCTYPE_MODELGROUP:         return "FCTYPE_MODELGROUP";         // 33
            case FCTYPE_REQUESTGRP:         return "FCTYPE_REQUESTGRP";         // 34
            case FCTYPE_STATUSGRP:          return "FCTYPE_STATUSGRP";          // 35
            case FCTYPE_GROUPCHAT:          return "FCTYPE_GROUPCHAT";          // 36
            case FCTYPE_CLOSEGRP:           return "FCTYPE_CLOSEGRP";           // 37
            case FCTYPE_UCR:                return "FCTYPE_UCR";                // 38
            case FCTYPE_MYUCR:              return "FCTYPE_MYUCR";              // 39
            case FCTYPE_SLAVECON:           return "FCTYPE_SLAVECON";           // 40
            case FCTYPE_SLAVECMD:           return "FCTYPE_SLAVECMD";           // 41
            case FCTYPE_SLAVEFRIEND:        return "FCTYPE_SLAVEFRIEND";        // 42
            case FCTYPE_SLAVEVSHARE:        return "FCTYPE_SLAVEVSHARE";        // 43
            case FCTYPE_ROOMDATA:           return "FCTYPE_ROOMDATA";           // 44
            case FCTYPE_NEWSITEM:           return "FCTYPE_NEWSITEM";           // 45
            case FCTYPE_GUESTCOUNT:         return "FCTYPE_GUESTCOUNT";         // 46
            case FCTYPE_PRELOGINQ:          return "FCTYPE_PRELOGINQ";          // 47
            case FCTYPE_MODELGROUPSZ:       return "FCTYPE_MODELGROUPSZ";       // 48
            case FCTYPE_ROOMHELPER:         return "FCTYPE_ROOMHELPER";         // 49
            case FCTYPE_CMESG:              return "FCTYPE_CMESG";              // 50
            case FCTYPE_JOINCHAN:           return "FCTYPE_JOINCHAN";           // 51
            case FCTYPE_CREATECHAN:         return "FCTYPE_CREATECHAN";         // 52
            case FCTYPE_INVITECHAN:         return "FCTYPE_INVITECHAN";         // 53
            case FCTYPE_RPC:                return "FCTYPE_RPC";                // 54
            case FCTYPE_QUIETCHAN:          return "FCTYPE_QUIETCHAN";          // 55
            case FCTYPE_BANCHAN:            return "FCTYPE_BANCHAN_xxx_bug";    // 56       [ deprecated ]
            case FCTYPE_PREVIEWCHAN:        return "FCTYPE_PREVIEWCHAN";        // 57
            case FCTYPE_SHUTDOWN:           return "FCTYPE_SHUTDOWN";           // 58
            case FCTYPE_LISTBANS:           return "FCTYPE_LISTBANS_xxx_bug";   // 59       [ deprecated ]         
            case FCTYPE_UNBAN:              return "FCTYPE_UNBAN_xxx_bug";      // 60       [ deprecated ]         
            case FCTYPE_SETWELCOME:         return "FCTYPE_SETWELCOME";         // 61                              
            case FCTYPE_CHANOP:             return "FCTYPE_CHANOP";             // 62                              
            case FCTYPE_LISTCHAN:           return "FCTYPE_LISTCHAN";           // 63                              
            case FCTYPE_TAGS:               return "FCTYPE_TAGS";               // 64                              
            case FCTYPE_SETPCODE:           return "FCTYPE_SETPCODE";           // 65                              
            case FCTYPE_SETMINTIP:          return "FCTYPE_SETMINTIP";          // 66                              
            case FCTYPE_UEOPT:              return "FCTYPE_UEOPT";              // 67                              
            case FCTYPE_HDVIDEO:            return "FCTYPE_HDVIDEO";            // 68                              
            case FCTYPE_METRICS:            return "FCTYPE_METRICS";            // 69                              
            case FCTYPE_OFFERCAM:           return "FCTYPE_OFFERCAM";           // 70                              
            case FCTYPE_REQUESTCAM:         return "FCTYPE_REQUESTCAM";         // 71                              
            case FCTYPE_MYWEBCAM:           return "FCTYPE_MYWEBCAM";           // 72                              
            case FCTYPE_MYCAMSTATE:         return "FCTYPE_MYCAMSTATE";         // 73                              
            case FCTYPE_PMHISTORY:          return "FCTYPE_PMHISTORY";          // 74                              
            case FCTYPE_CHATFLASH:          return "FCTYPE_CHATFLASH";          // 75                              
            case FCTYPE_TRUEPVT:            return "FCTYPE_TRUEPVT";            // 76                              
            case FCTYPE_BOOKMARKS:          return "FCTYPE_BOOKMARKS";          // 77                              
            case FCTYPE_EVENT:              return "FCTYPE_EVENT";              // 78                              
            case FCTYPE_STATEDUMP:          return "FCTYPE_STATEDUMP";          // 79                              
            case FCTYPE_RECOMMEND:          return "FCTYPE_RECOMMEND";          // 80                              
            case FCTYPE_EXTDATA:            return "FCTYPE_EXTDATA";            // 81                              
            case FCTYPE_ADMINEXT:           return "FCTYPE_ADMINEXT";           // 82                              
            case FCTYPE_SESSEVENT:          return "FCTYPE_SESSEVENT";          // 83                              
            case FCTYPE_NOTIFY:             return "FCTYPE_NOTIFY";             // 84                              
            case FCTYPE_PUBLISH:            return "FCTYPE_PUBLISH";            // 85                              
            case FCTYPE_XREQUEST:           return "FCTYPE_XREQUEST";           // 86                              
            case FCTYPE_XRESPONSE:          return "FCTYPE_XRESPONSE";          // 87                              
            case FCTYPE_EDGECON:            return "FCTYPE_EDGECON";            // 88                              
            case FCTYPE_XMESG:              return "FCTYPE_XMESG";              // 89                              
            case FCTYPE_CLUBSHOW:           return "FCTYPE_CLUBSHOW";           // 90                              
            case FCTYPE_CLUBCMD:            return "FCTYPE_CLUBCMD";            // 91                              
            case FCTYPE_AGENT:              return "FCTYPE_AGENT";              // 92                              
        //  case FCTYPE_RESERVED_93:        return "FCTYPE_RESERVED_93";        // 93       [ unused / reserved ]  
        //  case FCTYPE_RESERVED_94:        return "FCTYPE_RESERVED_94";        // 94       [ unused / reserved ]  
            case FCTYPE_ZGWINVALID:         return "FCTYPE_ZGWINVALID";         // 95                              
            case FCTYPE_CONNECTING:         return "FCTYPE_CONNECTING";         // 96                              
            case FCTYPE_CONNECTED:          return "FCTYPE_CONNECTED";          // 97                              
            case FCTYPE_DISCONNECTED:       return "FCTYPE_DISCONNECTED";       // 98                              
            case FCTYPE_LOGOUT:             return "FCTYPE_LOGOUT";             // 99                              
        }                                                                                                          
                                                                                                              
        snprintf(s_szType, sizeof(s_szType), "FCTYPE_UNKNOWN_%u", dwType);                                         
        return s_szType;
    }
                                                                                                              
            
    enum DataMode
    {
        DATA_DETECT = 0,
        DATA_JSON,
        DATA_RAW
    };

    static const size_t MAX_DATA_SZ = 1024*4096;            // 4mb as upper limit on packet size

    FcMsg()
    {
        pchMsg = NULL;
        clear();    
    }

    FcMsg(const FcMsg& copyFrom)
    {
        pchMsg = NULL;
